In [1]:
import pandas as pd

In [2]:
import xgboost,sqlalchemy

In [3]:
df = pd.read_csv('titanic.csv')

In [4]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [5]:
import psycopg2

In [6]:
conn = psycopg2.connect("host='db' dbname='postgres' user='postgres' password='postgres'")

In [7]:
cursor = conn.cursor()

In [8]:
engine = sqlalchemy.create_engine('postgresql://postgres:postgres@db:5432/postgres')

In [13]:
df.to_sql('titanic',engine)

In [9]:
df_pg = pd.read_sql_query("""select * from titanic""",con=engine)

In [10]:
df_pg.head()

,index,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500